app/controllers/employee_controller.rb

  def show_all
  	@result = Employee.all
---
SELECT "employees".* FROM "employees"

  def create

    Rails.logger.debug "params are #{params.inspect} "

    emp = Employee.new
    emp.name = params["name"]
    emp.age = params["age"]
    emp.date_of_joining = params["date_of_joining"]
    emp.designation = params["designation"].to_s
    emp.team_lead = params["team_lead"]
    emp.current_project = params["current_project"]
    emp.skills = params["skills"]
    emp.save
---
INSERT INTO "employees" ("name", "age", "date_of_joining", "designation", "team_lead", "skills", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def details
    Rails.logger.debug "params are #{params.inspect} "
    puts params["id"]
    @res= Employee.find(params["id"])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show_team_leads
    @result=Employee.select(:team_lead).distinct.pluck(:team_lead)
---
SELECT DISTINCT "employees"."team_lead" FROM "employees"

  def team_details
    Rails.logger.debug "params are #{params.inspect} "
    team_lead = params["name"]
    @res = Employee.where("team_lead = '#{team_lead}'")
---
SELECT "employees".* FROM "employees" WHERE (team_lead = 'sdaa')